{
  "name": "Gabriel C. Miron",
  "photo": "assets/img/foto.jpg",
  "job": "Estudante no curso de Engenharia de Software - UTFPR",
  "location": "Cornélio Procópio - PR",
  "phone": "(17) 99772-1021",
  "email": "gabrielcmiron@gmail.com",
  "skills": {
    "hardSkills": [
      {
        "name": "HTML",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/html.png"
      },
      {
        "name": "CSS",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/css.png"
      },
      {
        "name": "JavaScript",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/js.png"
      },
      {
        "name": "Python",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/python.png"
      },
      {
        "name": "PHP",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/php.png"
      },
      {
        "name": "MySql",
        "logo": "https://raw.githubusercontent.com/digitalinnovationone/js-developer-portfolio/main/data/imgs/mysql.png"
      }
    ],
    "softSkills": [
      "Empatia",
      "Comunicação",
      "Trabalho em equipe",
      "Flexibilidade",
      "Organização"
    ]
  },
  "languages": [
    "Português BR",
    "Inglês (intermediário-avançado)"
  ],
  "portfolio": [
    {
      "name": "Portfólio com sites que realizei durante minha trajetória de estudos.",
      "url": "https://github.com/GabrielCotrimMiron?tab=repositories",
      "github": true
    }
  ],
  "professionalExperience": [
    {
      "name": "ETEC - Escola Técnica Estadual de São Paulo - Curso Técnico em Desenvolvimento de Sistemas",
      "period": "2022 - 2024",
      "description": "Durante minha trajetória na ETEC, cursei o Ensino Médio integrado ao Técnico em Desenvolvimento de Sistemas. Essa formação me proporcionou uma base sólida e prática na área de tecnologia, abordando disciplinas como programação web, banco de dados, desenvolvimento mobile, Arduino e ferramentas do pacote Office. Ao longo do curso, desenvolvi projetos relevantes como o WorkAble, voltado à inclusão de PCDs no mercado de trabalho; a Bobina de Tesla Musical, que transforma impulsos elétricos em música; e o Memory Up, focado na otimização da aprendizagem. Essa experiência ampliou minha visão sobre tecnologia e reforçou habilidades como trabalho em equipe, resolução de problemas e gestão de projetos."
    },
    {
      "name": "Universidade Tecnológica Federal do Paraná - Bacharelado em Engenharia de Software",
      "period": "2025 - 2028",
      "description": "Atualmente, curso Engenharia de Software na Universidade Tecnológica Federal do Paraná (UTFPR), uma das principais instituições de ensino do Brasil na área tecnológica. O bacharelado possui uma abordagem ampla e prática, envolvendo o desenvolvimento de software, engenharia de requisitos, arquitetura de sistemas, banco de dados e cibersegurança. Além disso, o curso fortalece habilidades como resolução de problemas, trabalho em equipe, gestão de projetos e comunicação técnica, essenciais para o mercado de tecnologia."
    },
    {
      "name": "CNA - Escola de Inglês",
      "period": "2017 - 2024",
      "description": "Durante meus mais de 8 anos na escola CNA, aprimorando meu inglês por meio de aulas teóricas, gramática, conversação, redação e muitas aulas práticas de conversação, adquiri uma base sólida no idioma, tanto para a comunicação quanto para a escrita."
    }
  ]
}
